# IsValidShape Method

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DirectShape..::..IsValidShape Method
DirectShape Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidShape(ExternallyTaggedGeometryObject) | Validates shape to be stored in a DirectShape. |
| IsValidShape(IList<(Of <<'(GeometryObject>)>>)) | Validates shape to be stored in a DirectShape. Supercedes and extends IsValidGeometry(). |
| IsValidShape(IList<(Of <<'(GeometryObject>)>>), DirectShapeTargetViewType) | Validates view-specific shape to be stored in a DirectShape. Expects a non-default view type. |

# See Also
DirectShape Class
DirectShape Members
Autodesk.Revit.DB Namespace